package Exercise_Array;

public class Exercise01 {
/*
 * 
1. 5개 정수를 입력받은 후 차례로 출력하는 프로그램 

2. 문자 10개를 저장할 수 있는 배열을 선언하고 10개의 문자를 입력받아 입력받은 문자를 이어서 출력하는 프로그램 

3. 정수 10개를 입력받은 후 세번째, 다섯번쨰와 마지막으로 입력받은 정수를 차례로 출력하는 프로그램 

4. 최대 100개까지의 정수를 차례로 입력받다가 0이 입력되면 입력을 중단하고 짝수 번째에 입력된 정수를 모두 출력하는 프로그램 작성 

5. 100개의 정수를 저장할 수 있는 배열을 선언하고 정수를 차례로 입력받다가 0이 입력되면 0을 제외하고 그때까지 입력된 정수를 가장 나중에 입력된 정수부터 차례대로 출력하는 프로그램 작성

6. 연도와 월을 입력받아 해당 월의 날수를 출력하다가 월이 0이면 종료하는 프로그램 (while이용) (월이 잘못 입력되면 "잘못 입력하였습니다."를 출력)

7. 10개의 정수를 입력받아 그 중 가장 큰 수를 출력하는 프로그램

8. 4자리 이하의 10개의 정수를 입력받아 짝수중 가장 큰 값과 홀수중 가장 작은 값을 출력하는 프로그램 

9. 10명의 컴퓨터 정수를 입력받아 배열에 저장하고 총점과 평균을 구하여 출력하는 프로그램을 작성 

10. 5개의 정수를 {95, 75, 85, 100, 50}로 초기화하고 오름차순으로 정렬하는 프로그램 

11. 10개의 정수를 입력받아 배열에 저장한후 내림차순으로 정렬하는 프로그램 

12. 100개 이하의 정수를 입력받다가 0이 입력되면 0을 제외하고 그때까지 입력받은 개수를 출력한 후 입력받은 정수를 차례로 출력하되 그 수가 홀수이면 2배한 값을 짝수인 경우에는 2로 나눈 몫을 출력하는 프로그램 

*/
}
